[
  {
    "id": 1,
    "title": "Club President Takes 2nd Place in Regional Championships",
    "tag": "Tournament Result",
    "date": "2025-05-04",
    "content": "Our club president Michael Chen secured 2nd place in the Regional College Chess Championships, beating multiple titled players. Chen's remarkable performance included a brilliant queen sacrifice in the semi-finals. The tournament featured 64 players from 12 colleges across the region.",
    "imageUrl": "https://images.unsplash.com/photo-1580541832626-2a7131ee809f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2071&q=80"
  },
  {
    "id": 2,
    "title": "Chess Society Awarded 'Club of the Year'",
    "tag": "Society News",
    "date": "2025-04-20",
    "content": "Our Chess Society has been awarded the prestigious 'Club of the Year' title by the university's Student Union. The award recognizes our tremendous growth over the past year, our community outreach programs, and our success in organizing several major tournaments. Special thanks to all members and volunteers who made this possible!",
    "imageUrl": "https://images.unsplash.com/photo-1637249772402-24de03c13d9a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1160&q=80"
  },
  {
    "id": 3,
    "title": "Summer Chess Camp Announced for Local Schools",
    "tag": "Community Outreach",
    "date": "2025-04-15",
    "content": "We're excited to announce our annual Summer Chess Camp for local schools. This year, we're expanding to accommodate more students from grades 3-12. The week-long program will include instruction from our top players, daily tournaments, and special guest lectures. Registration opens on May 1st and space is limited.",
    "imageUrl": "https://images.unsplash.com/photo-1623500549493-68b92cb636fd?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2070&q=80"
  },
  {
    "id": 4,
    "title": "Chess Society to Host National Collegiate Championship",
    "tag": "Tournament News",
    "date": "2025-04-02",
    "content": "We're proud to announce that our university has been selected to host the National Collegiate Chess Championship next semester. This prestigious event will bring together top college chess players from across the country. Our society will be working closely with the National Chess Federation to organize this week-long tournament.",
    "imageUrl": "https://images.unsplash.com/photo-1627389955928-2f3643208a20?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1287&q=80"
  },
  {
    "id": 5,
    "title": "New Chess Tutorial Series Launched on YouTube",
    "tag": "Educational",
    "date": "2025-03-25",
    "content": "We've launched a new tutorial series on our YouTube channel, aimed at helping beginners improve their game. The series, called 'Chess Fundamentals', covers openings, tactics, strategy, and endgames. New videos will be released every Tuesday and Friday. Special thanks to our educational team led by Sarah Wong for producing this high-quality content.",
    "imageUrl": "https://images.unsplash.com/photo-1585571293049-2e06882d7d86?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2070&q=80"
  },
  {
    "id": 6,
    "title": "Chess Society Partners with Local Senior Centers",
    "tag": "Community Outreach",
    "date": "2025-03-10",
    "content": "We're excited to announce our new partnership with five local senior centers to bring chess to elderly residents. Our members will visit these centers weekly to teach and play chess with seniors. This initiative aims to combat isolation and promote cognitive health among the elderly. If you're interested in volunteering, please contact our community outreach coordinator.",
    "imageUrl": "https://images.unsplash.com/photo-1581008685504-7a71a2857ce3?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2070&q=80"
  },
  {
    "id": 7,
    "title": "Chess Society Members Participate in Charity Simultaneous Exhibition",
    "tag": "Charity Event",
    "date": "2025-02-28",
    "content": "Ten of our top players participated in a charity simultaneous exhibition last weekend, raising over $2,000 for the Children's Hospital. Each player faced 5-10 opponents simultaneously, creating an exciting event that drew both chess enthusiasts and curious spectators. Thanks to everyone who participated and donated to this worthy cause.",
    "imageUrl": "https://images.unsplash.com/photo-1592853625597-7d17be820d0c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2070&q=80"
  },
  {
    "id": 8,
    "title": "Chess Books Donation Drive Exceeds Expectations",
    "tag": "Club News",
    "date": "2025-02-15",
    "content": "Our recent chess books donation drive exceeded all expectations, collecting over 200 books! These books will be distributed to local schools, community centers, and our own growing library. We extend our sincere thanks to all donors, especially Grand Master Books for their generous contribution of 50 new chess manuals.",
    "imageUrl": "https://images.unsplash.com/photo-1577364458531-72b0d5516271?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1332&q=80"
  }
]